{
  "name": "__EAnimDataModelNotifyType",
  "isEnum": true,
  "properties": {
    "BracketOpened": [
      "EAnimDataModelNotifyType",
      "Indicates a bracket has been opened. Type of payload: FBracketPayload"
    ],
    "BracketClosed": [
      "EAnimDataModelNotifyType",
      "Indicates a bracket has been closed. Type of payload: FEmptyPayload"
    ],
    "TrackAdded": [
      "EAnimDataModelNotifyType",
      "Indicates a new bone track has been added. Type of payload: FAnimationTrackAddedPayload"
    ],
    "TrackChanged": [
      "EAnimDataModelNotifyType",
      "Indicates the keys of a bone track have been changed. Type of payload: FAnimationTrackChangedPayload"
    ],
    "TrackRemoved": [
      "EAnimDataModelNotifyType",
      "Indicates a bone track has been removed. Type of payload: FAnimationTrackRemovedPayload"
    ],
    "SequenceLengthChanged": [
      "EAnimDataModelNotifyType",
      "Indicates the play length of the animated data has changed. Type of payload: FSequenceLengthChangedPayload"
    ],
    "FrameRateChanged": [
      "EAnimDataModelNotifyType",
      "Indicates the sampling rate of the animated data has changed. Type of payload: FFrameRateChangedPayload"
    ],
    "CurveAdded": [
      "EAnimDataModelNotifyType",
      "Indicates a new curve has been added. Type of payload: FCurveAddedPayload"
    ],
    "CurveChanged": [
      "EAnimDataModelNotifyType",
      "Indicates a curve its data has been changed. Type of payload: FCurveChangedPayload"
    ],
    "CurveRemoved": [
      "EAnimDataModelNotifyType",
      "Indicates a curve has been removed. Type of payload: FCurveRemovedPayload"
    ],
    "CurveFlagsChanged": [
      "EAnimDataModelNotifyType",
      "Indicates a curve its flags have changed. Type of payload: FCurveFlagsChangedPayload"
    ],
    "CurveRenamed": [
      "EAnimDataModelNotifyType",
      "Indicates a curve has been renamed. Type of payload: FCurveRenamedPayload"
    ],
    "CurveScaled": [
      "EAnimDataModelNotifyType",
      "Indicates a curve has been scaled. Type of payload: FCurveScaledPayload"
    ],
    "CurveColorChanged": [
      "EAnimDataModelNotifyType",
      "Indicates a curve its color has changed. Type of payload: FCurveChangedPayload"
    ],
    "CurveCommentChanged": [
      "EAnimDataModelNotifyType",
      "Indicates a curve has been removed. Type of payload: FCurveChangedPayload"
    ],
    "AttributeAdded": [
      "EAnimDataModelNotifyType",
      "Indicates a new attribute has been added. Type of payload: FAttributeAddedPayload"
    ],
    "AttributeRemoved": [
      "EAnimDataModelNotifyType",
      "Indicates a new attribute has been removed. Type of payload: FAttributeRemovedPayload"
    ],
    "AttributeChanged": [
      "EAnimDataModelNotifyType",
      "Indicates an attribute has been changed. Type of payload: FAttributeChangedPayload"
    ],
    "Populated": [
      "EAnimDataModelNotifyType",
      "Indicates the data model has been populated from the source UAnimSequence. Type of payload: FEmptyPayload"
    ],
    "Reset": [
      "EAnimDataModelNotifyType",
      "Indicates all data stored on the model has been reset. Type of payload: FEmptyPayload"
    ],
    "SkeletonChanged": [
      "EAnimDataModelNotifyType",
      "Indicates that the skeleton changed. Type of payload: FEmptyPayload"
    ],
    "Invalid": [
      "EAnimDataModelNotifyType"
    ],
    "EAnimDataModelNotifyType_MAX": [
      "EAnimDataModelNotifyType"
    ]
  },
  "methods": []
}