{
  "name": "__ECollisionEnabled",
  "isEnum": true,
  "doc": "Enum used to describe what type of collision is enabled on a body.",
  "properties": {
    "NoCollision": [
      "ECollisionEnabled",
      "Will not create any representation in the physics engine. Cannot be used for spatial queries (raycasts, sweeps, overlaps) or simulation (rigid body, constraints). Best performance possible (especially for moving objects)"
    ],
    "QueryOnly": [
      "ECollisionEnabled",
      "Only used for spatial queries (raycasts, sweeps, and overlaps). Cannot be used for simulation (rigid body, constraints). Useful for character movement and things that do not need physical simulation. Performance gains by keeping data out of simulation tree."
    ],
    "PhysicsOnly": [
      "ECollisionEnabled",
      "Only used only for physics simulation (rigid body, constraints). Cannot be used for spatial queries (raycasts, sweeps, overlaps). Useful for jiggly bits on characters that do not need per bone detection. Performance gains by keeping data out of query tree"
    ],
    "QueryAndPhysics": [
      "ECollisionEnabled",
      "Can be used for both spatial queries (raycasts, sweeps, overlaps) and simulation (rigid body, constraints)."
    ],
    "ProbeOnly": [
      "ECollisionEnabled",
      "Only used for probing the physics simulation (rigid body, constraints). Cannot be used for spatial queries (raycasts,\n              sweeps, overlaps). Useful for when you want to detect potential physics interactions and pass contact data to hit callbacks\n              or contact modification, but don't want to physically react to these contacts."
    ],
    "QueryAndProbe": [
      "ECollisionEnabled",
      "Can be used for both spatial queries (raycasts, sweeps, overlaps) and probing the physics simulation (rigid body,\n              constraints). Will not allow for actual physics interaction, but will generate contact data, trigger hit callbacks, and\n              contacts will appear in contact modification."
    ],
    "ECollisionEnabled_MAX": [
      "ECollisionEnabled"
    ]
  },
  "methods": []
}