{
  "name": "__ETextureSourceEncoding",
  "isEnum": true,
  "doc": "List of (advanced) texture source encodings, matching the list in ColorManagementDefines.h.",
  "properties": {
    "TSE_None": [
      "ETextureSourceEncoding",
      "The source encoding is not overridden."
    ],
    "TSE_Linear": [
      "ETextureSourceEncoding",
      "The source encoding is considered linear (before optional sRGB encoding is applied)."
    ],
    "TSE_sRGB": [
      "ETextureSourceEncoding",
      "sRGB source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_ST2084": [
      "ETextureSourceEncoding",
      "SMPTE ST 2084/PQ source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_Gamma22": [
      "ETextureSourceEncoding",
      "Gamma 2.2 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_BT1886": [
      "ETextureSourceEncoding",
      "BT1886/Gamma 2.4 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_Gamma26": [
      "ETextureSourceEncoding",
      "Gamma 2.6 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_Cineon": [
      "ETextureSourceEncoding",
      "Cineon source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_REDLog": [
      "ETextureSourceEncoding",
      "RED Log source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_REDLog3G10": [
      "ETextureSourceEncoding",
      "RED Log3G10 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_SLog1": [
      "ETextureSourceEncoding",
      "Sony SLog1 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_SLog2": [
      "ETextureSourceEncoding",
      "Sony SLog2 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_SLog3": [
      "ETextureSourceEncoding",
      "Sony SLog3 source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_AlexaV3LogC": [
      "ETextureSourceEncoding",
      "ARRI Alexa V3 LogC source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_CanonLog": [
      "ETextureSourceEncoding",
      "Canon Log source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_ProTune": [
      "ETextureSourceEncoding",
      "GoPro ProTune source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_VLog": [
      "ETextureSourceEncoding",
      "Panasonic V-Log source encoding to be linearized (before optional sRGB encoding is applied)."
    ],
    "TSE_MAX": [
      "ETextureSourceEncoding"
    ]
  },
  "methods": []
}