{
  "name": "__EWidgetClipping",
  "isEnum": true,
  "doc": "This enum controls clipping of widgets in Slate.  By default all SWidgets do not need to clip their children.\nMost of the time, you don't need to clip, the only times it becomes important is when something might become hidden\ndue to panning.  You should use this wisely, as Slate can not batch across clipping areas, so if widget A and widget B\nare set to EWidgetClipping::Yes, no drawing that happens inside their widget trees will ever be batch together, adding\nadditional GPU overhead.",
  "properties": {
    "Inherit": [
      "EWidgetClipping",
      "This widget does not clip children, it and all children inherit the clipping area of the last widget that clipped."
    ],
    "ClipToBounds": [
      "EWidgetClipping",
      "This widget clips content the bounds of this widget.  It intersects those bounds with any previous clipping area."
    ],
    "ClipToBoundsWithoutIntersecting": [
      "EWidgetClipping",
      "This widget clips to its bounds.  It does NOT intersect with any existing clipping geometry, it pushes a new clipping\nstate.  Effectively allowing it to render outside the bounds of hierarchy that does clip.\n\nNOTE: This will NOT allow you ignore the clipping zone that is set to [Yes - Always]."
    ],
    "ClipToBoundsAlways": [
      "EWidgetClipping",
      "This widget clips to its bounds.  It intersects those bounds with any previous clipping area.\n\nNOTE: This clipping area can NOT be ignored, it will always clip children.  Useful for hard barriers\nin the UI where you never want animations or other effects to break this region."
    ],
    "OnDemand": [
      "EWidgetClipping",
      "This widget clips to its bounds when it's Desired Size is larger than the allocated geometry\nthe widget is given.  If that occurs, it work like [Yes].\n\nNOTE: This mode was primarily added for Text, which is often placed into containers that eventually\nare resized to not be able to support the length of the text.  So rather than needing to tag every\ncontainer that could contain text with [Yes], which would result in almost no batching, this mode\nwas added to dynamically adjust the clipping if needed.  The reason not every panel is set to OnDemand,\nis because not every panel returns a Desired Size that matches what it plans to render at."
    ],
    "EWidgetClipping_MAX": [
      "EWidgetClipping"
    ]
  },
  "methods": []
}