{
  "name": "FTakeRecorderProjectParameters",
  "isStruct": true,
  "properties": {
    "RootTakeSaveDir": [
      "FDirectoryPath",
      "The root of the directory in which to save recorded takes."
    ],
    "TakeSaveDir": [
      "FString",
      "The name of the directory in which to save recorded takes. Supports any of the following format specifiers that will be substituted when a take is recorded:\n{day}       - The day of the timestamp for the start of the recording.\n{month}     - The month of the timestamp for the start of the recording.\n{year}      - The year of the timestamp for the start of the recording.\n{hour}      - The hour of the timestamp for the start of the recording.\n{minute}    - The minute of the timestamp for the start of the recording.\n{second}    - The second of the timestamp for the start of the recording.\n{take}      - The take number.\n{slate}     - The slate string."
    ],
    "DefaultSlate": [
      "FString",
      "The default name to use for the Slate information"
    ],
    "RecordingClockSource": [
      "EUpdateClockSource",
      "The clock source to use when recording"
    ],
    "bStartAtCurrentTimecode": [
      "bool",
      "If enabled, track sections will start at the current timecode. Otherwise, 0."
    ],
    "bRecordTimecode": [
      "bool",
      "If enabled, timecode will be recorded into each actor track"
    ],
    "bRecordSourcesIntoSubSequences": [
      "bool",
      "If enabled, each Source will be recorded into a separate Sequence and embedded in the Root Sequence will link to them via Subscenes track.\nIf disabled, all Sources will be recorded into the Root Sequence, and you will not be able to swap between various takes of specific source\nusing the Sequencer Take ui. This can still be done via copying and pasting between sequences if needed."
    ],
    "bRecordToPossessable": [
      "bool",
      "* If enabled, all recorded actors will be recorded to possessable object bindings in Sequencer. If disabled, all recorded actors will be\n* recorded to spawnable object bindings in Sequencer. This can be overridden per actor source."
    ],
    "DefaultTracks": [
      "TArray<FTakeRecorderTrackSettings>",
      2,
      "List of property names for which movie scene tracks will always record."
    ],
    "bShowNotifications": [
      "bool",
      "Whether to show notification windows or not when recording"
    ]
  },
  "methods": [
    {
      "name": "opAssign",
      "return": "FTakeRecorderProjectParameters&",
      "args": [
        {
          "name": "Other",
          "type": "FTakeRecorderProjectParameters"
        }
      ]
    }
  ]
}