{
  "name": "FTargetChainFKSettings",
  "isStruct": true,
  "properties": {
    "EnableFK": [
      "bool",
      "Whether to copy the shape of the chain from the source skeleton using the Rotation and Translation modes. Default is true.\nNOTE: All FK operations run before the IK pass to copy the shape of the FK chain from the source skeleton."
    ],
    "RotationMode": [
      "ERetargetRotationMode",
      "Determines how rotation is copied from the source chain to the target chain. Default is Interpolated.\nInterpolated: Source and target chains are normalized by their length, then each target bone rotation is generated by finding the rotation at the same normalized distance on the source chain and interpolating between the neighboring bones.\nOne to One: Each target bone rotation is copied from the equivalent bone in the source chain, based on the order in the chain, starting at the root of the chain. If the target chain has more bones than the source, the extra bones will remain at their reference pose.\nOne to One Reversed: Same as One-to-One, but starting from the tip of the chain.\nNone: The rotation of each target bone in the chain is left at the reference pose."
    ],
    "RotationAlpha": [
      "float32",
      "Range +/- infinity. Default 1. Scales the amount of rotation that is applied.\nIf Rotation Mode is None this parameter has no effect.\nOtherwise, this parameter blends the rotation of each bone in the chain from the base retarget pose (0) to the retargeted pose (1)."
    ],
    "TranslationMode": [
      "ERetargetTranslationMode",
      "Determines how translation is copied from the source chain to the target chain. Default is None.\nNone: Translation of target bones are left unmodified from the retarget pose.\nGlobally Scaled: Translation of target bone is set to the source bone offset multiplied by the global scale of the skeleton (determined by the relative height difference between retarget root bones).\nAbsolute: Translation of target bone is set to the absolute position of the source bone."
    ],
    "TranslationAlpha": [
      "float32",
      "Range +/- infinity. Default 1. Scales the amount of translation that is applied. Exact behavior depends on the Translation Mode.\nIn None Mode, this parameter has no effect.\nIn Globally Scaled and Absolute modes, the translation offset is scaled by this parameter."
    ],
    "PoleVectorMatching": [
      "float32",
      "Range 0 to 1. Default 1. Matches the twist angle of this chain (along the Pole direction) to the source chain.\nAt 0, the chain's pole vector direction will be left alon\nAt 1, the root bone of the chain will be twist-rotated in the pole direction to match the orientation of the source chain."
    ],
    "PoleVectorMaintainOffset": [
      "bool",
      "Default is False. When true, the original offset between the source/target pole vectors will be maintained when using Pole Vector Matching."
    ],
    "PoleVectorOffset": [
      "float32",
      "Range +/- 180. Default 0. An angular offset, in degrees, for the pole direction of the chain."
    ]
  },
  "methods": [
    {
      "name": "opAssign",
      "return": "FTargetChainFKSettings&",
      "args": [
        {
          "name": "Other",
          "type": "FTargetChainFKSettings"
        }
      ]
    }
  ]
}