{
  "name": "FTimeStretchCurve",
  "isStruct": true,
  "doc": "= Time Stretch Curve =\n\n= What is it?\n\n        The Time Stretch Curve is an optional float curve that montages can\n        use to define where a montage is allowed to speed up or slow down.\n        Let's say we have a montage of default play time T_Original.\n        We now want that montage to play for a different T_Target play time\n        Typically we would uniformly play rate the animation to reach that goal.\n\n        The Time Stretch Curve allows doing the same thing but non uniformly,\n        by defining which regions can be play rated more or less.\n\n        The Curve values are normalized.\n        So a Curve value of 0 means \"don't play rate this\".\n        And a Curve value of 1 means \"play rate this the most\".\n        Intermediate values will be weighted accordingly.\n\n        Imagine the following scenario, you have a character attacking with a staff.\n        The animation is authored with holds after striking.\n        Let's say the character levels up over the course of the game, and\n        their attacks are getting faster and faster (play time is shorter).\n\n        By using a Time Stretch Curve, most of the time compression could happen\n        during the holds. So the strikes look mostly unaffected.\n        This allows using a single animation, and scaling it for very different\n        desired play times.\n\n= How does it work?\n\n        Given a Montage of length T_Original, and a float curve C.\n        Curve C is sampled over N segments of fixed time 'SamplingTimeStep'.\n        Each element, C_i is normalized. 0 <= C_i <= 1\n        and 0 <= i <= N.\n\n        We have Sum(SamplingTimeStep) = T_Original = N * SamplingTimeStep\n        SamplingTimeStep = T_Original / N\n\n        Given a different length T_Target,\n        C remaps positions from T_Target to T_Original according to the following function:\n        dTO = dT_i * U * (1 + S * C_i)\n        where:\n        Sum(dTO) = T_Original\n        Sum(dT_i) = T_Target\n        U = UniformPlayRate\n        S = Curve Scale Factor\n        C_i = sampled curve value, constant over the interval dTO\n\n        dTO is fixed, based on the chosen 'SamplingTimeStep',\n        but in practice we can combine consecutive segments that have the same C_i value.\n\n        We would like U to be 1 (or -1) as much as possible.\n        Meaning the Curve should do all the remapping whenever possible.\n        U(niformPlayRate) should only come into play when C can't remap T_Target to T_Original on its own.\n        This can happen when trying to speed up the animation,\n        but the Curve is not enough to reach that time compression.\n        In that event, uniform scaling kicks in.\n\n        We call PR_i (or OverallPlayRate for Segment i)\n        PR_i = U * (1 + S * C_i)\n        dTO = dT_i * PR_i\n\n        We also want PR_i > 0, that is it should never backtrack or pause during playback of animation.\n        A Montage can still play in reverse with U < 0.\n\n= How is T_Target defined?\n\n        When we play a Montage with a PlayRate of PR, we assume this means:\n        T_Target = T_Original * PR\n        So this system does not change the interface for playing a montage.\n\n        If a curve is not defined, the mapping is defined as:\n        dTO_i = dT_i * U\n\n        If a a curve is defined:\n        dTO_i = dT_i * U * (1 + S * C_i)\n\n        We can see that no curve means S == 0.\n        Also if we're not scaling the montage, T_Target == T_Original, we also have S == 0.\n\n        So, this makes the curve completely optional. And it seamlessly integrates with the current montage interface.\n        If you want playback time to be half, that means playing the montage with a play rate of 2.\n        If there is a TimeStretchCurve, it will be used.\n        But regardless or using a curve or not, play back time is guaranteed.\n\n= Finding U and S =\n\n        Ideally, we could figure out what U and S are given a T_Target play time.\n        Unfortunately, the math for this is very complex.\n\n        We update the montage position like this:\n        dTO_i = dT_i * U * (1 + C_i)\n\n        We sum this over the N time segments:\n        Sum(dTO_i) = Sum(dT_i * U * (1 + C_i))\n        Sum(dTO_i) = Sum(dT_i) * U + Sum(dT_i * U * S * C_i))\n        T_Original = T_Target * U + U * S * Sum(dT_i * C_i)\n\n        Where:\n        S = (T_Original - T_Target * U) / (U * Sum(dT_i * C_i))\n\n        If we were able to get dT_i constant, we could pull it out and get:\n        S = (T_Original - T_Target * U) / (U * dT * Sum(C_i))\n        Where Sum(C_i) can be pre-computed.\n\n        Unfortunately we don't have dT_i constant, and we can't,\n        since it is variable, and dependent on what S and U are.\n\n        So our approach instead is to precompute lower and upper bounds for this curve.\n        We cache the results for dT_i for S = 100.f and S = -1.f + 0.01f\n        This gives us data for T_Target_Min and T_Target_Max.\n        Within these bounds, we can approximate dT_i, and also Sum(dT_i * C_i) by linear interpolation.\n        Outside of these bounds, we rely on U to get us to our desired T_Target play back time.\n\n        'ConditionallyUpdateTimeStretchCurveCachedData' takes care of figuring out U and S\n        based on a given T_Target play back time.\n\n= 'target' and 'original' space\n\n        At run time, we generate a set of markers in what we call 'target' and 'original' space.\n        'original' space means in the original play time the montage was authored in.\n        So that maps to actual frames of animation and actual position in the montage.\n\n        'target' space is the same set of markers, but mapped in play back time.\n        That is the actual time it takes to play back this montage.\n\n        Taking our play rate equation from above, it is:\n        dT_Original = dT_Target * U * (1 + S * C_i)\n\n        We see that montage position = playback time * play rate.\n\n        Once we have mapped our markers in both 'target' and 'original' space,\n        we can easily go from one to the other, since time moves linearly between markers.\n        Since between markers the play rate is defined as constant values:\n        PR_i = U * (1.f + S * C_i).\n        And we know that C_i is constant between two markers.\n\n        So if we know between which markers we are in one space, we can switch to the other space instantly,\n        as our relative position between these markers will be the same.\n\n        So by jumping between these spaces, we can quickly go from a montage position to its playback time.\n        We can increase the playback time by the current's frame deltatime,\n        and jump back to the corresponding frame of animation.\n        That's in a nutshell how this system works.",
  "properties": {
    "SamplingRate": [
      "float32",
      2,
      "Desired Sampling rate of above curve.\nThis will be rounded off so we sample the whole curve\nwith a fixed time step."
    ],
    "CurveValueMinPrecision": [
      "float32",
      2,
      "Minimum delta allowed between consecutive sampled segments.\nbelow this value, segments will be combined\nto optimize number of markers."
    ],
    "Sum_dT_i_by_C_i": [
      "float32",
      2,
      "Cached Sum(dT_i * C_i)"
    ]
  },
  "methods": [
    {
      "name": "opAssign",
      "return": "FTimeStretchCurve&",
      "args": [
        {
          "name": "Other",
          "type": "FTimeStretchCurve"
        }
      ]
    }
  ]
}