{
  "name": "UAnimCompress_RemoveLinearKeys",
  "inherits": "UAnimCompress",
  "properties": {
    "MaxPosDiff": [
      "float32",
      2,
      "Maximum position difference to use when testing if an animation key may be removed. Lower values retain more keys, but yield less compression."
    ],
    "MaxAngleDiff": [
      "float32",
      2,
      "Maximum angle difference to use when testing if an animation key may be removed. Lower values retain more keys, but yield less compression."
    ],
    "MaxScaleDiff": [
      "float32",
      2,
      "Maximum Scale difference to use when testing if an animation key may be removed. Lower values retain more keys, but yield less compression."
    ],
    "MaxEffectorDiff": [
      "float32",
      2,
      "As keys are tested for removal, we monitor the effects all the way down to the end effectors.\nIf their position changes by more than this amount as a result of removing a key, the key will be retained.\nThis value is used for all bones except the end-effectors parent."
    ],
    "MinEffectorDiff": [
      "float32",
      2,
      "As keys are tested for removal, we monitor the effects all the way down to the end effectors.\nIf their position changes by more than this amount as a result of removing a key, the key will be retained.\nThis value is used for the end-effectors parent, allowing tighter restrictions near the end of a skeletal chain."
    ],
    "EffectorDiffSocket": [
      "float32",
      2,
      "Error threshold for End Effectors with Sockets attached to them.\nTypically more important bone, where we want to be less aggressive with compression."
    ],
    "ParentKeyScale": [
      "float32",
      2,
      "A scale value which increases the likelihood that a bone will retain a key if it's parent also had a key at the same time position.\nHigher values can remove shaking artifacts from the animation, at the cost of compression."
    ],
    "bRetarget": [
      "bool",
      "true = As the animation is compressed, adjust animated nodes to compensate for compression error.\nfalse= Do not adjust animated nodes."
    ],
    "bActuallyFilterLinearKeys": [
      "bool",
      "Controls whether the final filtering step will occur, or only the retargetting after bitwise compression.\nIf both this and bRetarget are false, then the linear compressor will do no better than the underlying bitwise compressor, extremely slowly."
    ]
  },
  "methods": []
}