{
  "name": "UAssetDefinition",
  "inherits": "UObject",
  "doc": "Asset Definitions represent top level assets that are known to the editor.\n\n-- Conversion Guide --\nAsset Definitions (UAssetDefinitionDefault) are a replacement to the Asset Actions (FAssetTypeActions_Base) system.\nThe reasons for the replacement are multitude, but the highlights are,\n\nAsset Definitions no longer do things like provide a GetActions function, the replacement for this is you using the\nnew UToolMenu extension system to register actions for the assets, an example is in this document.  A lot of the\nAPIs have been tweaked and cleaned up to make them easier to upgrade in the future, a lot of the original API for\nAsset Actions were added one at a time, and several of them could be combined in simpler ways.  Another benefit is\nsoon we might be able to make the AssetTools module no longer a circular dependency.\n\nAll of this is in service to what was previously impossible.  To be able to right click on assets in the Content\nBrowser and NOT have the asset and every asset it knew about load on right click, this previous impossible to escape\nbyproduct slowed down working in the editor constantly because things that didn’t require opening the asset became\nnecessary, and some assets could load *A LOT* of other content.\n\nUnfortunately I can’t prevent people from backsliding, at least for now.  Even after fixing the APIs to not require\nloading, people need to be cleverer (Use Asset Tag Data) in how they provide right click options for assets.  But to\nhelp, you can run the editor with -WarnIfAssetsLoaded on the command line.  I’ve added a new utility class to the\nengine called, FWarnIfAssetsLoadedInScope, it causes notifications with callstacks to be popped up telling you what\ncode is actually responsible for any asset loads within earmarked scopes that should NOT be loading assets.\n\nBackwards Compatibility\nThe new system is fully* backwards compatible.  Asset Definitions are registered with the old Asset Tools\n(IAssetTools::RegisterAssetTypeActions) this is done through the   FAssetDefinitionProxy.  Similarly, Asset Actions\n(FAssetTypeActions_Base) are registered with the Asset Definition Registry with an Asset Definition Proxy (UAssetDefinition_AssetTypeActionsProxy).\n\nWhen converting Asset Actions to AssetDefinitions and you’re trying to understand how to map a specific function to\nthe new system it can be helpful to look at the equivalent function in FAssetDefinitionProxy.\n\nIMPORTANT - You are no longer allowed to register multiple Asset Definitions for the same Asset Class.  There were a\nvery small number of people doing this to do some tricky things with filters which are no longer required.  The new\nsystem will yell at you if you do this.\n\n\nRegistration\nRegistering your Asset Definition is no longer required like it was for Asset Actions.  The UObjects are automatically\nregistered with the new Asset Definition Registry (UAssetDefinitionRegistry).\n\nYou no longer need to register Categories for your Asset Definition, like you had to do with Asset Actions.  Your\nAssets categories are just an array of FAssetCategoryPath.  They have accelerator constructors to just take an FText\nfor the main category, and the sub category (if there is one) which replaces the whole “GetSubMenus” function from\nAsset Actions.  The new version can go further, with multiple sub menus and categories, but the UI isn’t set up for it yet.\n\nGetActions\nThe function GetActions no longer exists, the replacement is to somewhere put a self registering callback to register\nthe UToolMenu extension, but you can just put it at the bottom of your .cpp for your AssetDefinition, that is where\nthe others are.  The template goes something like this,\n\n// Menu Extensions\n//--------------------------------------------------------------------\n\n\nnamespace MenuExtension_YOUR_CLASS_TYPE\n{\n  static void ExecuteActionForYourType(const FToolMenuContext& InContext)\n  {\n     const UContentBrowserAssetContextMenuContext* Context = UContentBrowserAssetContextMenuContext::FindContextWithAssets(InContext);\n\n     for (YOUR_CLASS_TYPE* LoadedInstance : Context->LoadSelectedObjects<YOUR_CLASS_TYPE>())\n     {\n     }\n  }\n\n  static FDelayedAutoRegisterHelper DelayedAutoRegister(EDelayedRegisterRunPhase::EndOfEngineInit, []{\n     UToolMenus::RegisterStartupCallback(FSimpleMulticastDelegate::FDelegate::CreateLambda([]()\n     {\n        FToolMenuOwnerScoped OwnerScoped(UE_MODULE_NAME);\n        UToolMenu* Menu = UE::ContentBrowser::ExtendToolMenu_AssetContextMenu(YOUR_CLASS_TYPE::StaticClass());\n\n        FToolMenuSection& Section = Menu->FindOrAddSection(\"GetAssetActions\");\n        Section.AddDynamicEntry(NAME_None, FNewToolMenuSectionDelegate::CreateLambda([](FToolMenuSection& InSection)\n        {\n           const TAttribute<FText> Label = LOCTEXT(\"YOUR_ASSET_TYPE_ExecuteActionForYourType\", \"Execute Action For Your Type\");\n           const TAttribute<FText> ToolTip = LOCTEXT(\"YOUR_ASSET_TYPE_ExecuteActionForYourTypeTooltip\", \"This will execute the action for your type.\");\n           const FSlateIcon Icon = FSlateIcon();\n\n\n           FToolUIAction UIAction;\n           UIAction.ExecuteAction = FToolMenuExecuteAction::CreateStatic(&ExecuteActionForYourType);\n           InSection.AddMenuEntry(\"YOUR_ASSET_TYPE_ExecuteActionForYourType\", Label, ToolTip, Icon, UIAction);\n        ));\n     }));\n  });\n}\n\nIt’s very important that you do not load the asset in your CanExecuteAction callback or in this self callback, you should save that until you finally get Executed.\nIf you’re looking for examples, there are tons you'll find by searching for “namespace MenuExtension_”.\n\nGetFilterName & BuildBackendFilter\nThese functions have been replaced by BuildFilters. The new function is great, you can provide an array of filters that are available with this asset.  So for example,\nBlueprints provide a filter for Blueprint Class, but they also provide the filters for Blueprint Interface, Blueprint Macro Library and Blueprint Function library,\nwhich are all UBlueprint assets, but differ based on Asset Tag data.",
  "properties": {},
  "methods": []
}