{
  "name": "UAudioComponent",
  "inherits": "USceneComponent",
  "doc": "AudioComponent is used to play a Sound\n\n@see https://docs.unrealengine.com/WorkingWithAudio/Overview\n@see USoundBase",
  "properties": {
    "DefaultParameters": [
      "TArray<FAudioParameter>",
      "Array of parameters for this AudioComponent. Changes to this array directly will\nnot be forwarded to the sound if the component is actively playing, and will be superseded\nby parameters set via the actor interface if set, or the instance parameters."
    ],
    "SoundClassOverride": [
      "USoundClass",
      2,
      "SoundClass that overrides that set on the referenced SoundBase when component is played."
    ],
    "PitchModulationMin": [
      "float32",
      "The lower bound to use when randomly determining a pitch multiplier"
    ],
    "PitchModulationMax": [
      "float32",
      "The upper bound to use when randomly determining a pitch multiplier"
    ],
    "VolumeModulationMin": [
      "float32",
      "The lower bound to use when randomly determining a volume multiplier"
    ],
    "VolumeModulationMax": [
      "float32",
      "The upper bound to use when randomly determining a volume multiplier"
    ],
    "EnvelopeFollowerAttackTime": [
      "int",
      "The attack time in milliseconds for the envelope follower. Delegate callbacks can be registered to get the\nenvelope value of sounds played with this audio component."
    ],
    "EnvelopeFollowerReleaseTime": [
      "int",
      "The release time in milliseconds for the envelope follower. Delegate callbacks can be registered to get the\nenvelope value of sounds played with this audio component."
    ],
    "Priority": [
      "float32",
      "If enabled, overrides the priority of the selected sound with the value provided."
    ],
    "SubtitlePriority": [
      "float32",
      "Used by the subtitle manager to prioritize subtitles wave instances spawned by this component."
    ],
    "SourceEffectChain": [
      "USoundEffectSourcePresetChain",
      "The chain of Source Effects to apply to the sounds playing on the Audio Component"
    ],
    "ConcurrencySet": [
      "TSet<TObjectPtr<USoundConcurrency>>",
      "What sound concurrency rules to use for sounds generated by this audio component"
    ],
    "AutoAttachLocationRule": [
      "EAttachmentRule",
      "Options for how we handle our location when we attach to the AutoAttachParent, if bAutoManageAttachment is true.\n@see bAutoManageAttachment, EAttachmentRule"
    ],
    "AutoAttachRotationRule": [
      "EAttachmentRule",
      "Options for how we handle our rotation when we attach to the AutoAttachParent, if bAutoManageAttachment is true.\n@see bAutoManageAttachment, EAttachmentRule"
    ],
    "AutoAttachScaleRule": [
      "EAttachmentRule",
      "Options for how we handle our scale when we attach to the AutoAttachParent, if bAutoManageAttachment is true.\n@see bAutoManageAttachment, EAttachmentRule"
    ],
    "OnAudioPlayStateChanged": [
      "FOnAudioPlayStateChanged",
      "This function returns the Targeted Audio Component's current Play State.\nPlaying, if the sound is currently playing.\nStopped, if the sound is stopped.\nPaused, if the sound is currently playing, but paused.\nFading In, if the sound is in the process of Fading In.\nFading Out, if the sound is in the process of Fading Out."
    ],
    "OnAudioVirtualizationChanged": [
      "FOnAudioVirtualizationChanged",
      "Called when virtualization state changes"
    ],
    "OnAudioFinished": [
      "FOnAudioFinished",
      "Called when we finish playing audio, either because it played to completion or because a Stop() call turned it off early"
    ],
    "OnAudioPlaybackPercent": [
      "FOnAudioPlaybackPercent",
      "Called as a sound plays on the audio component to allow BP to perform actions based on playback percentage.\nComputed as samples played divided by total samples, taking into account pitch.\nNot currently implemented on all platforms."
    ],
    "OnAudioSingleEnvelopeValue": [
      "FOnAudioSingleEnvelopeValue"
    ],
    "OnAudioMultiEnvelopeValue": [
      "FOnAudioMultiEnvelopeValue"
    ],
    "AutoAttachParent": [
      "TWeakObjectPtr<USceneComponent>",
      "Component we automatically attach to when activated, if bAutoManageAttachment is true.\nIf null during registration, we assign the existing AttachParent and defer attachment until we activate.\n@see bAutoManageAttachment"
    ],
    "AutoAttachSocketName": [
      "FName",
      "Socket we automatically attach to on the AutoAttachParent, if bAutoManageAttachment is true.\n@see bAutoManageAttachment"
    ],
    "bOverrideAttenuation": [
      "bool",
      "Allows defining attenuation settings directly on this audio component without using an attenuation settings asset."
    ],
    "Sound": [
      "USoundBase",
      "The sound to be played"
    ],
    "bAllowSpatialization": [
      "bool",
      "Overrides spatialization enablement in either the attenuation asset or on this audio component's attenuation settings override."
    ],
    "bOverrideSubtitlePriority": [
      "bool",
      "Whether or not to override the sound's subtitle priority."
    ],
    "bIsUISound": [
      "bool",
      "Whether or not this sound plays when the game is paused in the UI"
    ],
    "bEnableLowPassFilter": [
      "bool",
      "Whether or not to apply a low-pass filter to the sound that plays in this audio component."
    ],
    "bOverridePriority": [
      "bool",
      "Whether or not to override the priority of the given sound with the value provided."
    ],
    "bSuppressSubtitles": [
      "bool",
      "If true, subtitles in the sound data will be ignored."
    ],
    "bCanPlayMultipleInstances": [
      "bool",
      "If true, the Audio Component will play multiple sound instances at once. Switching sounds or calling play while already playing\nwill not stop already active instances. Virtualization for all played sounds will be disabled. Disabling while sound(s) are playing\nwill not take effect until the AudioComponent is stopped and restarted."
    ],
    "bDisableParameterUpdatesWhilePlaying": [
      "bool",
      "If true, the Audio Component will ignore parameter updates for already-playing sound(s)."
    ],
    "bAutoManageAttachment": [
      "bool",
      "True if we should automatically attach to AutoAttachParent when Played, and detach from our parent when playback is completed.\nThis overrides any current attachment that may be present at the time of activation (deferring initial attachment until activation, if AutoAttachParent is null).\nIf enabled, this AudioComponent's WorldLocation will no longer be reliable when not currently playing audio, and any attach children will also be\ndetached/attached along with it.\nWhen enabled, detachment occurs regardless of whether AutoAttachParent is assigned, and the relative transform from the time of activation is restored.\nThis also disables attachment on dedicated servers, where we don't actually activate even if bAutoActivate is true.\n@see AutoAttachParent, AutoAttachSocketName, AutoAttachLocationType"
    ],
    "VolumeMultiplier": [
      "float32",
      "A volume multiplier to apply to sounds generated by this component"
    ],
    "PitchMultiplier": [
      "float32",
      "A pitch multiplier to apply to sounds generated by this component"
    ],
    "LowPassFilterFrequency": [
      "float32",
      "If enabled, the frequency of the Lowpass Filter (in Hz) to apply to this voice. A frequency of 0.0 is the device sample rate and will bypass the filter."
    ],
    "AttenuationSettings": [
      "USoundAttenuation",
      "If bOverrideSettings is false, the asset to use to determine attenuation properties for sounds generated by this component"
    ],
    "AttenuationOverrides": [
      "FSoundAttenuationSettings",
      "If bOverrideSettings is true, the attenuation properties to use for sounds generated by this component"
    ],
    "ModulationRouting": [
      "FSoundModulationDefaultRoutingSettings"
    ]
  },
  "methods": [
    {
      "name": "AdjustAttenuation",
      "return": "void",
      "doc": "This function is used to modify the Attenuation Settings on the targeted Audio Component instance. It is worth noting that Attenuation Settings are only passed to new Active Sounds on start, so modified Attenuation data should be set before sound playback.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InAttenuationSettings",
          "type": "FSoundAttenuationSettings"
        }
      ]
    },
    {
      "name": "AdjustVolume",
      "return": "void",
      "doc": "This function allows designers to trigger an adjustment to the sound instance’s playback Volume with options for smoothly applying a curve over time.\n@param AdjustVolumeDuration The length of time in which to interpolate between the initial volume and the new volume.\n@param AdjustVolumeLevel The new volume to set the Audio Component to.\n@param FadeCurve The curve used when interpolating between the old and new volume.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "AdjustVolumeDuration",
          "type": "float32"
        },
        {
          "name": "AdjustVolumeLevel",
          "type": "float32"
        },
        {
          "name": "FadeCurve",
          "default": "EAudioFaderCurve :: Linear",
          "type": "EAudioFaderCurve"
        }
      ]
    },
    {
      "name": "GetAttenuationSettingsToApply",
      "return": "bool",
      "doc": "Retrieves Attenuation Settings data on the targeted Audio Component. Returns FALSE if no settings were found.\nBecause the Attenuation Settings data structure is copied, FALSE returns will return default values.",
      "ufunction": true,
      "unrealname": "BP_GetAttenuationSettingsToApply",
      "meta": null,
      "args": [
        {
          "name": "OutAttenuationSettings",
          "type": "FSoundAttenuationSettings&"
        }
      ]
    },
    {
      "name": "FadeIn",
      "return": "void",
      "doc": "This function allows designers to call Play on an Audio Component instance while applying a volume curve over time.\nParameters allow designers to indicate the duration of the fade, the curve shape, and the start time if seeking into the sound.\n\n@param FadeInDuration How long it should take to reach the FadeVolumeLevel\n@param FadeVolumeLevel The percentage of the AudioComponents's calculated volume to fade to\n@param FadeCurve The curve to use when interpolating between the old and new volume",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "FadeInDuration",
          "type": "float32"
        },
        {
          "name": "FadeVolumeLevel",
          "default": "1.000000",
          "type": "float32"
        },
        {
          "name": "StartTime",
          "default": "0.000000",
          "type": "float32"
        },
        {
          "name": "FadeCurve",
          "default": "EAudioFaderCurve :: Linear",
          "type": "EAudioFaderCurve"
        }
      ]
    },
    {
      "name": "FadeOut",
      "return": "void",
      "doc": "This function allows designers to call a delayed Stop on an Audio Component instance while applying a\nvolume curve over time. Parameters allow designers to indicate the duration of the fade and the curve shape.\n\n@param FadeOutDuration how long it should take to reach the FadeVolumeLevel\n@param FadeVolumeLevel the percentage of the AudioComponents's calculated volume in which to fade to\n@param FadeCurve The curve to use when interpolating between the old and new volume",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "FadeOutDuration",
          "type": "float32"
        },
        {
          "name": "FadeVolumeLevel",
          "type": "float32"
        },
        {
          "name": "FadeCurve",
          "default": "EAudioFaderCurve :: Linear",
          "type": "EAudioFaderCurve"
        }
      ]
    },
    {
      "name": "GetCookedEnvelopeData",
      "return": "bool",
      "doc": "Retrieves Cooked Amplitude Envelope Data at the current playback time. If there are multiple\nSoundWaves playing, data is interpolated and averaged across all playing sound waves.\nReturns FALSE if no data was found.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "OutEnvelopeData",
          "type": "float32&"
        }
      ]
    },
    {
      "name": "GetCookedEnvelopeDataForAllPlayingSounds",
      "return": "bool",
      "doc": "Retrieves the current-time amplitude envelope data of the sounds playing on the audio component.\nEnvelope data is not averaged or interpolated. Instead an array of data with all playing sound waves with cooked data is returned.\nReturns true if there is data and the audio component is playing.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "OutEnvelopeData",
          "type": "TArray<FSoundWaveEnvelopeDataPerSound>&"
        }
      ]
    },
    {
      "name": "GetCookedFFTData",
      "return": "bool",
      "doc": "Retrieves the current-time cooked spectral data of the sounds playing on the audio component.\nSpectral data is averaged and interpolated for all playing sounds on this audio component.\nReturns true if there is data and the audio component is playing.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "FrequenciesToGet",
          "type": "TArray<float32>"
        },
        {
          "name": "OutSoundWaveSpectralData",
          "type": "TArray<FSoundWaveSpectralData>&"
        }
      ]
    },
    {
      "name": "GetCookedFFTDataForAllPlayingSounds",
      "return": "bool",
      "doc": "Retrieves the current-time cooked spectral data of the sounds playing on the audio component.\nSpectral data is not averaged or interpolated. Instead an array of data with all playing sound waves with cooked data is returned.\nReturns true if there is data and the audio component is playing.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "OutSoundWaveSpectralData",
          "type": "TArray<FSoundWaveSpectralDataPerSound>&"
        }
      ]
    },
    {
      "name": "GetModulators",
      "return": "TSet<USoundModulatorBase>",
      "doc": "Gets the set of currently active modulators for a given Modulation Destination.\n@param Destination The Destination to retrieve the Modulators from.\n@return The set of of Modulators applied to this component for the given Destination.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "Destination",
          "type": "EModulationDestination"
        }
      ]
    },
    {
      "name": "GetPlayState",
      "return": "EAudioComponentPlayState",
      "const": true,
      "doc": "Returns the enumerated play states of the audio component.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "HasCookedAmplitudeEnvelopeData",
      "return": "bool",
      "const": true,
      "doc": "Queries whether or not the targeted Audio Component instance’s sound has Amplitude Envelope Data, returns FALSE if none found.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "HasCookedFFTData",
      "return": "bool",
      "const": true,
      "doc": "Queries if the sound wave playing in this audio component has cooked FFT data, returns FALSE if none found.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "IsPlaying",
      "return": "bool",
      "const": true,
      "doc": "Returns TRUE if the targeted Audio Component’s sound is playing.\nDoesn't indicate if the sound is paused or fading in/out. Use GetPlayState() to get the full play state.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "IsVirtualized",
      "return": "bool",
      "const": true,
      "doc": "Returns if the sound is virtualized.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "Play",
      "return": "void",
      "doc": "Begins playing the targeted Audio Component's sound at the designated Start Time, seeking into a sound.\n@param StartTime The offset, in seconds, to begin reading the sound at",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "StartTime",
          "default": "0.000000",
          "type": "float32"
        }
      ]
    },
    {
      "name": "PlayQuantized",
      "return": "void",
      "doc": "Start a sound playing on an audio component on a given quantization boundary with the handle to an existing clock",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InClockHandle",
          "type": "UQuartzClockHandle&"
        },
        {
          "name": "InQuantizationBoundary",
          "type": "FQuartzQuantizationBoundary&"
        },
        {
          "name": "InDelegate",
          "default": "FOnQuartzCommandEventBP ( )",
          "type": "FOnQuartzCommandEventBP"
        },
        {
          "name": "InStartTime",
          "default": "0.000000",
          "type": "float32"
        },
        {
          "name": "InFadeInDuration",
          "default": "0.000000",
          "type": "float32"
        },
        {
          "name": "InFadeVolumeLevel",
          "default": "1.000000",
          "type": "float32"
        },
        {
          "name": "InFadeCurve",
          "default": "EAudioFaderCurve :: Linear",
          "type": "EAudioFaderCurve"
        }
      ]
    },
    {
      "name": "SetAttenuationOverrides",
      "return": "void",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InAttenuationOverrides",
          "type": "FSoundAttenuationSettings"
        }
      ]
    },
    {
      "name": "SetAttenuationSettings",
      "return": "void",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InAttenuationSettings",
          "type": "USoundAttenuation"
        }
      ]
    },
    {
      "name": "SetAudioBusSendPostEffect",
      "return": "void",
      "doc": "Sets how much audio the sound should send to the given Audio Bus (POST Source Effects).\nif the Audio Bus Send doesn't already exist, it will be added to the overrides on the active sound.\n@param AudioBus The Bus to send the signal to\n@param AudioBusSendLevel The scalar used to alter the volume of the copied signal",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "AudioBus",
          "type": "UAudioBus"
        },
        {
          "name": "AudioBusSendLevel",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetAudioBusSendPreEffect",
      "return": "void",
      "doc": "Sets how much audio the sound should send to the given Audio Bus (PRE Source Effects).\nif the Bus Send doesn't already exist, it will be added to the overrides on the active sound.\n@param AudioBus The Bus to send the signal to\n@param AudioBusSendLevel The scalar used to alter the volume of the copied signal",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "AudioBus",
          "type": "UAudioBus"
        },
        {
          "name": "AudioBusSendLevel",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetBoolParameter",
      "return": "void",
      "doc": "Sets a named Boolean",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InName",
          "type": "FName"
        },
        {
          "name": "InBool",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetFloatParameter",
      "return": "void",
      "doc": "Sets a named Float",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InName",
          "type": "FName"
        },
        {
          "name": "InFloat",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetIntParameter",
      "return": "void",
      "doc": "Sets a named Int32",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InName",
          "type": "FName"
        },
        {
          "name": "InInt",
          "type": "int"
        }
      ]
    },
    {
      "name": "SetLowPassFilterEnabled",
      "return": "void",
      "doc": "When set to TRUE, enables an additional Low Pass Filter Frequency to be calculated in with the\nsound instance’s LPF total, allowing designers to set filter settings for the targeted Audio Component’s\nsound instance.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InLowPassFilterEnabled",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetLowPassFilterFrequency",
      "return": "void",
      "doc": "Sets a cutoff frequency, in Hz, for the targeted Audio Component’s sound’s Low Pass Filter calculation.\nThe lowest cutoff frequency from all of the sound instance’s possible LPF calculations wins.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InLowPassFilterFrequency",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetModulationRouting",
      "return": "void",
      "doc": "Sets the routing for one of the given Audio component's Modulation Destinations.\n@param Modulators The set of modulators to apply to the given destination on the component.\n@param Destination The destination to assign the modulators to.\n@param RoutingMethod The routing method to use for the given modulator.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "Modulators",
          "type": "TSet<USoundModulatorBase>"
        },
        {
          "name": "Destination",
          "type": "EModulationDestination"
        },
        {
          "name": "RoutingMethod",
          "default": "EModulationRouting :: Inherit",
          "type": "EModulationRouting"
        }
      ]
    },
    {
      "name": "SetOutputToBusOnly",
      "return": "void",
      "doc": "Sets whether or not to output the audio to bus only.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "bInOutputToBusOnly",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetOverrideAttenuation",
      "return": "void",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "bInOverrideAttenuation",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetPaused",
      "return": "void",
      "doc": "Pause an audio component playing its sound cue, issue any delegates if needed",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "bPause",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetPitchMultiplier",
      "return": "void",
      "doc": "Set a new pitch multiplier",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "NewPitchMultiplier",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetSound",
      "return": "void",
      "doc": "Set what sound is played by this component",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "NewSound",
          "type": "USoundBase"
        }
      ]
    },
    {
      "name": "SetSourceBusSendPostEffect",
      "return": "void",
      "doc": "Allows designers to target a specific Audio Component instance’s sound and set the send level (volume of sound copied)\nto the indicated Source Bus. If the Source Bus is not already part of the sound’s sends, the reference will be added to\nthis instance’s Override sends. This particular send occurs after the Source Effect processing chain.\n@param SoundSourceBus The Bus to send the signal to\n@param SourceBusSendLevel The scalar used to alter the volume of the copied signal",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "SoundSourceBus",
          "type": "USoundSourceBus"
        },
        {
          "name": "SourceBusSendLevel",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetSourceBusSendPreEffect",
      "return": "void",
      "doc": "Allows designers to target a specific Audio Component instance’s sound and set the send level (volume of sound copied)\nto the indicated Source Bus. If the Source Bus is not already part of the sound’s sends, the reference will be added to\nthis instance’s Override sends. This particular send occurs before the Source Effect processing chain.\n@param SoundSourceBus The Bus to send the signal to.\n@param SourceBusSendLevel The scalar used to alter the volume of the copied signal.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "SoundSourceBus",
          "type": "USoundSourceBus"
        },
        {
          "name": "SourceBusSendLevel",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetSubmixSend",
      "return": "void",
      "doc": "Allows designers to target a specific Audio Component instance’s sound set the send level (volume of sound copied) to the indicated Submix.\n@param Submix The Submix to send the signal to.\n@param SendLevel The scalar used to alter the volume of the copied signal.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "Submix",
          "type": "USoundSubmixBase"
        },
        {
          "name": "SendLevel",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetUISound",
      "return": "void",
      "doc": "Set whether sounds generated by this audio component should be considered UI sounds",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "bInUISound",
          "type": "bool"
        }
      ]
    },
    {
      "name": "SetVolumeMultiplier",
      "return": "void",
      "doc": "Set a new volume multiplier",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "NewVolumeMultiplier",
          "type": "float32"
        }
      ]
    },
    {
      "name": "SetWaveParameter",
      "return": "void",
      "doc": "Sets the parameter matching the name indicated to the provided Wave. Provided for convenience/backward compatibility\nwith SoundCues (The parameter interface supports any object and is up to the system querying it to determine whether\nit is a valid type).\n@param InName The name of the parameter to assign the wave to.\n@param InWave The wave value to set.",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "InName",
          "type": "FName"
        },
        {
          "name": "InWave",
          "type": "USoundWave"
        }
      ]
    },
    {
      "name": "Stop",
      "return": "void",
      "doc": "Stop an audio component's sound, issue any delegates if needed",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "StopDelayed",
      "return": "void",
      "doc": "Cues request to stop sound after the provided delay (in seconds), stopping immediately if delay is zero or negative",
      "ufunction": true,
      "meta": null,
      "args": [
        {
          "name": "DelayTime",
          "type": "float32"
        }
      ]
    }
  ]
}