{
  "name": "UDrawSplineToolProperties",
  "inherits": "UInteractiveToolPropertySet",
  "properties": {
    "bLoop": [
      "bool",
      2,
      "Determines whether the created spline is a loop. This can be toggled using \"Closed Loop\" in\nthe detail panel after spline creation."
    ],
    "OutputMode": [
      "EDrawSplineOutputMode",
      2,
      "Determines how the resulting spline is emitted on tool accept."
    ],
    "TargetActor": [
      "TWeakObjectPtr<AActor>",
      2,
      "Actor to attach to when Output Mode is \"Existing Actor\""
    ],
    "BlueprintToCreate": [
      "TWeakObjectPtr<UBlueprint>",
      2,
      "Blueprint to create when Output Mode is \"Create Blueprint\""
    ],
    "ExistingSplineIndexToReplace": [
      "int",
      2,
      "When attaching to an existing actor or creating a blueprint, controls whether the drawn\nspline replaces one of the target's existing components or gets added as a new one (if\nthe index is out of bounds)."
    ],
    "DrawMode": [
      "EDrawSplineDrawMode",
      2,
      "How the spline is drawn in the tool."
    ],
    "MinPointSpacing": [
      "float",
      2,
      "Point spacing when Draw Mode is \"Free Draw\""
    ],
    "ClickOffset": [
      "float",
      2,
      "How far to offset spline points from the clicked surface, along the surface normal"
    ],
    "OffsetMethod": [
      "ESplineOffsetMethod",
      2,
      "How to choose the direction to offset points from the clicked surface"
    ],
    "OffsetDirection": [
      "FVector",
      2,
      "Manually-specified click offset direction. Note: Will be normalized. If it is a zero vector, a default Up vector will be used instead."
    ],
    "FrameVisualizationWidth": [
      "float",
      2,
      "When nonzero, allows a visualization of the rotation of the spline. Can be controlled\nin the detail panel after creation via \"Scale Visualization Width\" property."
    ],
    "UpVectorMode": [
      "EDrawSplineUpVectorMode",
      2,
      "How the spline rotation is set. It is suggested to use a nonzero FrameVisualizationWidth to\nsee the effects."
    ],
    "bPreviewUsingActorCopy": [
      "bool",
      2,
      "When modifying existing actors, whether the result should be previewed using a copy\nof that actor (rather than just drawing the spline by itself). Could be toggled off\nif something about duplicating the given actor is problematic."
    ],
    "bHitWorld": [
      "bool",
      2,
      "Whether to place spline points on the surface of objects in the world"
    ],
    "bHitCustomPlane": [
      "bool",
      2,
      "Whether to place spline points on a custom, user-adjustable plane"
    ],
    "bHitGroundPlanes": [
      "bool",
      2,
      "Whether to place spline points on a plane through the origin aligned with the Z axis in perspective views, or facing the camera in othographic views"
    ],
    "bRerunConstructionScriptOnDrag": [
      "bool",
      2,
      "If modifying a blueprint actor, whether to run the construction script while dragging\nor only at the end of a drag. Can be toggled off for expensive construction scripts."
    ]
  },
  "methods": []
}