{
  "name": "UFbxAnimSequenceImportData",
  "inherits": "UFbxAssetImportData",
  "doc": "Import data and options used when importing any mesh from FBX",
  "properties": {
    "bImportMeshesInBoneHierarchy": [
      "bool",
      2,
      "If checked, meshes nested in bone hierarchies will be imported instead of being converted to bones."
    ],
    "AnimationLength": [
      "EFBXAnimationLengthImportType",
      2,
      "Which animation range to import. The one defined at Exported, at Animated time or define a range manually"
    ],
    "FrameImportRange": [
      "FInt32Interval",
      2,
      "Frame range used when Set Range is used in Animation Length"
    ],
    "bUseDefaultSampleRate": [
      "bool",
      2,
      "If enabled, samples all animation curves to 30 FPS"
    ],
    "CustomSampleRate": [
      "int",
      2,
      "Sample fbx animation data at the specified sample rate, 0 find automaticaly the best sample rate"
    ],
    "bSnapToClosestFrameBoundary": [
      "bool",
      2,
      "If enabled, snaps the animation to the closest frame boundary using the import sampling rate"
    ],
    "bImportCustomAttribute": [
      "bool",
      2,
      "If true, import node attributes as either Animation Curves or Animation Attributes"
    ],
    "bDeleteExistingCustomAttributeCurves": [
      "bool",
      2,
      "If true, all previous node attributes imported as Animation Curves will be deleted when doing a re-import."
    ],
    "bDeleteExistingNonCurveCustomAttributes": [
      "bool",
      2,
      "If true, all previous node attributes imported as Animation Attributes will be deleted when doing a re-import."
    ],
    "bImportBoneTracks": [
      "bool",
      2,
      "Import bone transform tracks. If false, this will discard any bone transform tracks. (useful for curves only animations)"
    ],
    "bSetMaterialDriveParameterOnCustomAttribute": [
      "bool",
      2,
      "Set Material Curve Type for all custom attributes that exists"
    ],
    "bAddCurveMetadataToSkeleton": [
      "bool",
      2,
      "Whether to automatically add curve metadata to an animation's skeleton. If this is disabled, curve metadata will be added to skeletal meshes for morph targets, but no metadata entry will be created for general curves."
    ],
    "MaterialCurveSuffixes": [
      "TArray<FString>",
      2,
      "Set Material Curve Type for the custom attribute with the following suffixes. This doesn't matter if Set Material Curve Type is true"
    ],
    "bRemoveRedundantKeys": [
      "bool",
      2,
      "When importing custom attribute as curve, remove redundant keys"
    ],
    "bDeleteExistingMorphTargetCurves": [
      "bool",
      2,
      "If enabled, this will delete this type of asset from the FBX"
    ],
    "bDoNotImportCurveWithZero": [
      "bool",
      2,
      "When importing custom attribute or morphtarget as curve, do not import if it doesn't have any value other than zero. This is to avoid adding extra curves to evaluate"
    ],
    "bPreserveLocalTransform": [
      "bool",
      2,
      "If enabled, this will import a curve within the animation"
    ]
  },
  "methods": []
}