{
  "name": "UInterchangeGenericCommonMeshesProperties",
  "inherits": "UInterchangePipelineBase",
  "properties": {
    "ForceAllMeshAsType": [
      "EInterchangeForceMeshType",
      "If set, imports all meshes in the source as either static meshes or skeletal meshes."
    ],
    "bAutoDetectMeshType": [
      "bool",
      "If enabled, and some static mesh transforms are animated, the pipeline will convert the static mesh into a rigid skeletal mesh.\nThis setting is only used if the Force All Meshes As Type setting is set to \"None\"."
    ],
    "bImportLods": [
      "bool",
      "If enabled, any existing LODs for meshes are imported. This setting is only used if the Bake Meshes setting is also enabled."
    ],
    "bBakeMeshes": [
      "bool",
      "If enabled, meshes are baked with the scene instance hierarchy transform."
    ],
    "bKeepSectionsSeparate": [
      "bool",
      "If checked, sections with matching materials are kept separate and will not get combined."
    ],
    "VertexColorImportOption": [
      "EInterchangeVertexColorImportOption",
      "Specify how vertex colors should be imported."
    ],
    "VertexOverrideColor": [
      "FColor",
      "Specify an override color for use when the Vertex Color Import Option setting is set to Override."
    ],
    "bRecomputeNormals": [
      "bool",
      "If enabled, normals in the imported mesh are ignored and recomputed."
    ],
    "bRecomputeTangents": [
      "bool",
      "If enabled, tangents in the imported mesh are ignored and recomputed."
    ],
    "bUseMikkTSpace": [
      "bool",
      "If enabled, tangents are recomputed using MikkTSpace."
    ],
    "bComputeWeightedNormals": [
      "bool",
      "If enabled, normals are computed using the surface area and the corner angle of the triangle as a ratio."
    ],
    "bUseHighPrecisionTangentBasis": [
      "bool",
      "If true, tangents are stored at 16-bit vs 8-bit precision."
    ],
    "bUseFullPrecisionUVs": [
      "bool",
      "If true, UVs are stored at full floating-point precision."
    ],
    "bUseBackwardsCompatibleF16TruncUVs": [
      "bool",
      "If enabled, UVs are converted to 16-bit by a legacy truncation process instead of the default rounding process. This may avoid differences when reimporting older content."
    ],
    "bRemoveDegenerates": [
      "bool",
      "If true, degenerate triangles are removed."
    ]
  },
  "methods": []
}