{
  "name": "UModelingToolsEditorModeSettings",
  "inherits": "UDeveloperSettings",
  "doc": "Settings for the Modeling Tools Editor Mode plug-in.",
  "properties": {
    "AssetGenerationLocation": [
      "EModelingModeAssetGenerationLocation",
      2,
      "Where should Assets auto-generated by Modeling Tools be stored by default"
    ],
    "AssetGenerationMode": [
      "EModelingModeAssetGenerationBehavior",
      2,
      "How should Assets auto-generated by Modeling Tools be handled in terms of saving, naming, etc"
    ],
    "DefaultMeshObjectType": [
      "EModelingModeDefaultMeshObjectType",
      2,
      "What type of Mesh Object should Output Type Setting default to in Modeling Mode Tools (takes effect after Editor restart)"
    ],
    "AutoGeneratedAssetPath": [
      "FString",
      2,
      "Assets auto-generated by Modeling Tools are stored at this path, relative to the parent path defined by the Location. Set to an empty string to disable."
    ],
    "bStoreUnsavedLevelAssetsInTopLevelGameFolder": [
      "bool",
      2,
      "If true, Auto-Generated Assets created in an unsaved Level will be stored relative to top-level folder, otherwise they will be stored in /Temp and cannot be saved until they are explicitly moved to a permanent location"
    ],
    "bUsePerUserAutogenSubfolder": [
      "bool",
      2,
      "If true, Autogenerated Assets are stored in per-user folders below the Autogen path"
    ],
    "AutogenSubfolderUserNameOverride": [
      "FString",
      2,
      "Overrides the user name used for per-user folders below the Autogen path. This might be necessary to resolve issues with source control, for example. Note that the per-user folder name might not contain the name exactly as provided."
    ],
    "bAppendRandomStringToName": [
      "bool",
      2,
      "If true, Autogenerated Assets have a short random string generated and appended to their name"
    ],
    "bRespectLevelEditorGizmoMode": [
      "bool",
      2,
      "If true, the standard UE Editor Gizmo Mode (ie selected via the Level Editor Viewport toggle) will be used to configure the Modeling Gizmo, otherwise a Combined Gizmo will always be used. It may be necessary to exit and re-enter Modeling Mode after changing this setting."
    ],
    "bEnablePersistentSelections": [
      "bool",
      2,
      "old preference for mesh selection system that will be disabled in 5.3"
    ]
  },
  "methods": []
}