{
  "name": "UMVVMDeveloperProjectSettings",
  "inherits": "UDeveloperSettings",
  "doc": "Implements the settings for the MVVM Editor",
  "properties": {
    "FieldSelectorPermissions": [
      "TMap<FSoftClassPath,FMVVMDeveloperProjectWidgetSettings>",
      2,
      "Permission list for filtering which properties are visible in UI."
    ],
    "AllowedExecutionMode": [
      "TSet<EMVVMExecutionMode>",
      2,
      "Permission list for filtering which execution mode is allowed."
    ],
    "AllowedContextCreationType": [
      "TSet<EMVVMBlueprintViewModelContextCreationType>",
      2,
      "Permission list for filtering which context creation type is allowed."
    ],
    "bAllowBindingFromDetailView": [
      "bool",
      2,
      "Binding can be made from the DetailView Bind option."
    ],
    "bAllowGeneratedViewModelSetter": [
      "bool",
      2,
      "When generating a source in the viewmodel editor, allow the compiler to generate a setter function."
    ],
    "bAllowLongSourcePath": [
      "bool",
      2,
      "When generating a binding with a long source path, allow the compiler to generate a new viewmodel source."
    ],
    "bShowDetailViewOptionInBindingPanel": [
      "bool",
      2,
      "For the binding list widget, allow the user to edit the binding in the detail view."
    ],
    "bShowViewSettings": [
      "bool",
      2,
      "For the binding list widget and the viewmodel panel, allow the user to edit the view settings in the detail view."
    ],
    "bShowDeveloperGenerateGraphSettings": [
      "bool",
      2,
      "For the binding list widget, allow the user to generate a copy of the binding/event graph."
    ],
    "bAllowConversionFunctionGeneratedGraphInEditor": [
      "bool",
      2,
      "When a conversion function requires a wrapper graph, add and save the generated graph to the blueprint."
    ],
    "bAllowBindingEvent": [
      "bool",
      2,
      "When binding to a multicast delegate property, allow to create an event."
    ],
    "bCanCreateViewModelInView": [
      "bool",
      2,
      "Allow to create an instanced viewmodel directly in the view editor."
    ],
    "bExposeViewModelInstanceInEditor": [
      "bool",
      2,
      "When a viewmodel is set to Create Instance, allow modifying the viewmodel instance in the editor on all instances of the owning widget.\nThe per-viewmodel setting \"Expose Instance In Editor\" overrides this."
    ],
    "ConversionFunctionFilter": [
      "EMVVMDeveloperConversionFunctionFilterType",
      2,
      "Permission list for filtering which execution mode is allowed."
    ],
    "AllowedClassForConversionFunctions": [
      "TSet<FSoftClassPath>",
      2,
      "Individual class that are allowed to be uses as conversion functions."
    ],
    "FilterSettings": [
      "FMVVMViewBindingFilterSettings",
      2,
      "Settings for filtering the list of available properties and functions on binding creation."
    ]
  },
  "methods": []
}