{
  "name": "UNiagaraDataInterfaceSkeletalMesh",
  "inherits": "UNiagaraDataInterface",
  "doc": "Data Interface allowing sampling of skeletal meshes.",
  "properties": {
    "SourceMode": [
      "ENDISkeletalMesh_SourceMode",
      2,
      "Controls how to retrieve the Skeletal Mesh Component to attach to."
    ],
    "PreviewMesh": [
      "TSoftObjectPtr<USkeletalMesh>",
      2,
      "Mesh used to sample from when not overridden by a source actor from the scene. Only available in editor for previewing. This is removed in cooked builds."
    ],
    "DefaultMesh": [
      "USkeletalMesh",
      2,
      "Mesh used to sample from when not overridden by a source actor from the scene. This mesh is NOT removed from cooked builds."
    ],
    "SoftSourceActor": [
      "TSoftObjectPtr<AActor>",
      2,
      "The source actor from which to sample. Takes precedence over the direct mesh. Note that this can only be set when used as a user variable on a component in the world."
    ],
    "ComponentTags": [
      "TArray<FName>",
      2,
      "If defined, the supplied tags will be used to identify a valid component"
    ],
    "MeshUserParameter": [
      "FNiagaraUserParameterBinding",
      2,
      "Reference to a user parameter if we're reading one."
    ],
    "SkinningMode": [
      "ENDISkeletalMesh_SkinningMode",
      2,
      "Selects which skinning mode to use, for most cases Skin On The Fly will cover your requirements, see individual tooltips for more information."
    ],
    "SamplingRegions": [
      "TArray<FName>",
      2,
      "Sampling regions on the mesh from which to sample. Leave this empty to sample from the whole mesh."
    ],
    "WholeMeshLOD": [
      "int",
      2,
      "If no regions are specified, we'll sample the whole mesh at this LODIndex.\n-1 will use the lowest quality LOD available, i.e. Number of LODs - 1."
    ],
    "FilteredBones": [
      "TArray<FName>",
      2,
      "Set of filtered bones that can be used for sampling. Select from these with GetFilteredBoneAt and RandomFilteredBone."
    ],
    "FilteredSockets": [
      "TArray<FName>",
      2,
      "Set of filtered sockets that can be used for sampling. Select from these with GetFilteredSocketAt and RandomFilteredSocket."
    ],
    "ExcludeBoneName": [
      "FName",
      2,
      "Optionally remove a single bone from Random / Random Unfiltered access.\nYou can still include this bone in filtered list and access using the direct index functionality."
    ],
    "UvSetIndex": [
      "int",
      2,
      ""
    ],
    "bRequireCurrentFrameData": [
      "bool",
      2,
      "When this option is disabled, we use the previous frame's data for the skeletal mesh and can often issue the simulation early. This greatly\n      reduces overhead and allows the game thread to run faster, but comes at a tradeoff if the dependencies might leave gaps or other visual artifacts."
    ],
    "bReadDeformedGeometry": [
      "bool",
      2,
      "Overrides the project setting and allows you to opt out of reading from deformed geometry.\nThese is not performance gain from doing this, the branches will still exist in the generated code."
    ],
    "bExcludeBone": [
      "bool"
    ]
  },
  "methods": []
}