{
  "name": "UNiagaraEditorSettings",
  "inherits": "UDeveloperSettings",
  "properties": {
    "DefaultScript": [
      "FSoftObjectPath",
      2,
      "Niagara script to duplicate as the base of all new script assets created."
    ],
    "DefaultDynamicInputScript": [
      "FSoftObjectPath",
      2,
      "Niagara script to duplicate as the base of all new script assets created."
    ],
    "DefaultFunctionScript": [
      "FSoftObjectPath",
      2,
      "Niagara script to duplicate as the base of all new script assets created."
    ],
    "DefaultModuleScript": [
      "FSoftObjectPath",
      2,
      "Niagara script to duplicate as the base of all new script assets created."
    ],
    "RequiredSystemUpdateScript": [
      "FSoftObjectPath",
      2,
      "Niagara script which is required in the system update script to control system state."
    ],
    "DefaultValidationRuleSets": [
      "TArray<TSoftObjectPtr<UNiagaraValidationRuleSet>>",
      2,
      "Validation rules applied to all Niagara systems."
    ],
    "GraphCreationShortcuts": [
      "TArray<FNiagaraSpawnShortcut>",
      2,
      "Shortcut key bindings that if held down while doing a mouse click, will spawn the specified type of Niagara node."
    ],
    "bSimplifyStackNodesAtLowResolution": [
      "bool",
      2,
      "If true then emitter and system nodes will show a simplified representation on low zoom levels. This improves performance and readablity when zoomed out of the system overview graph."
    ],
    "LowResolutionNodeMaxNameChars": [
      "int",
      2,
      "The max number of chars before names on the low resolution nodes are truncated."
    ],
    "bAlwaysZoomToFitSystemGraph": [
      "bool",
      2,
      "If true then the system editor will zoom to fit all emitters when opening an asset."
    ],
    "RendererCategoryExpandState": [
      "ENiagaraCategoryExpandState",
      2,
      ""
    ],
    "DefaultsSequencerSubtracks": [
      "ENiagaraAddDefaultsTrackMode",
      2,
      ""
    ],
    "bAutoCompile": [
      "bool",
      2,
      "Whether or not auto-compile is enabled in the editors."
    ],
    "bAutoPlay": [
      "bool",
      2,
      "Whether or not simulations should start playing automatically when the emitter or system editor is opened, or when the data is changed in the editor."
    ],
    "bResetSimulationOnChange": [
      "bool",
      2,
      "Whether or not the simulation should reset when a value on the emitter or system is changed."
    ],
    "bResimulateOnChangeWhilePaused": [
      "bool",
      2,
      "Whether or not to rerun the simulation to the current time when making modifications while paused."
    ],
    "bResetDependentSystemsWhenEditingEmitters": [
      "bool",
      2,
      "Whether or not to reset all components that include the system currently being reset."
    ],
    "bDisplayAdvancedParameterPanelCategories": [
      "bool",
      2,
      "Whether or not to display advanced categories for the parameter panel."
    ],
    "bDisplayAffectedAssetStats": [
      "bool",
      2,
      "If true, then the emitter and script editors will show an info message how many downstream asset are affected by a change. Gathering this information for large asset graphs can delay the opening of the asset editors a bit."
    ],
    "AffectedAssetSearchLimit": [
      "int",
      2,
      "The maximum amount of asset references that are searched before stopping. Setting this too high can lead to long load times when opening default assets (basically the same as disabling the breadth limit in the reference viewer)."
    ],
    "bUpdateStackValuesOnCommitOnly": [
      "bool",
      2,
      "This affects numeric inputs for modules. When set to false, the inputs update the simulation while typing. When set to true, the simulation is only updated after submitting the change by pressing Enter."
    ],
    "PlaybackSpeeds": [
      "TArray<float32>",
      2,
      "Speeds used for slowing down and speeding up the playback speeds"
    ],
    "ActionColors": [
      "FNiagaraActionColors",
      2,
      ""
    ],
    "CurveTemplates": [
      "TArray<FNiagaraCurveTemplate>",
      2,
      ""
    ]
  },
  "methods": []
}