{
  "name": "UPersonaOptions",
  "inherits": "UObject",
  "properties": {
    "ShowMeshStats": [
      "int",
      2,
      "Currently Stats can have None, Basic and Detailed. Please refer to EDisplayInfoMode."
    ],
    "DefaultLocalAxesSelection": [
      "uint",
      2,
      "Index used to determine which ViewMode should be used by default for the Animation Editor(s)"
    ],
    "DefaultBoneDrawSelection": [
      "uint",
      2,
      "Index used to determine which Bone Draw Mode should be used by default for the Animation Editor(s)"
    ],
    "DefaultBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "SelectedBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "AffectedBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "DisabledBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "ParentOfSelectedBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "VirtualBoneColor": [
      "FLinearColor",
      2,
      ""
    ],
    "SectionTimingNodeColor": [
      "FLinearColor",
      2,
      ""
    ],
    "NotifyTimingNodeColor": [
      "FLinearColor",
      2,
      ""
    ],
    "BranchingPointTimingNodeColor": [
      "FLinearColor",
      2,
      ""
    ],
    "bPauseAnimationOnCameraMove": [
      "bool",
      2,
      "Pause the preview animation if playing when moving the camera and resume when finished"
    ],
    "bUseInlineSocketEditor": [
      "bool",
      2,
      "Whether to use a socket editor that is created in-line inside the skeleton tree, or whether to use the separate details panel"
    ],
    "bFlattenSkeletonHierarchyWhenFiltering": [
      "bool",
      2,
      "Whether to keep the hierarchy or flatten it when searching for bones, sockets etc."
    ],
    "bHideParentsWhenFiltering": [
      "bool",
      2,
      "Whether to hide parent items when filtering or to display them grayed out"
    ],
    "bExpandTreeOnSelection": [
      "bool",
      2,
      "Whether to focus and expand an item's tree recursively based on selection"
    ],
    "bAllowPreviewMeshCollectionsToSelectFromDifferentSkeletons": [
      "bool",
      2,
      ""
    ],
    "bAllowPreviewMeshCollectionsToUseCustomAnimBP": [
      "bool",
      2,
      ""
    ],
    "bAllowMeshSectionSelection": [
      "bool",
      2,
      "Whether or not Skeletal Mesh Section selection should be enabled by default for the Animation Editor(s)"
    ],
    "NumFolderFiltersInAssetBrowser": [
      "uint",
      2,
      "The number of folder filters to allow at any one time in the animation tool's asset browser"
    ],
    "bAllowIncompatibleSkeletonSelection": [
      "bool",
      2,
      "Whether to allow animation assets that are incompatible with the current skeleton/skeletal mesh to be selected."
    ],
    "bUseTreeViewForAnimationCurves": [
      "bool",
      2,
      "Whether to use tree view for animation curves"
    ],
    "AnimationCurveGroupingDelimiters": [
      "FString",
      2,
      "Delimiters to split animation curve names for grouping"
    ],
    "bAutoAlignFloorToMesh": [
      "bool",
      "Whether or not the floor should be aligned to the Skeletal Mesh's bounds by default for the Animation Editor(s)"
    ],
    "bAlwaysOpenAnimationAssetsInNewTab": [
      "bool",
      "Whether or not the Animation Editor opens in an additional tab when double clicking an animation asset or if it reuses an already existing Animation Editor tab.\nYou can also keep this disabled and hold shift pressed while double clicking the asset to open the asset inside its own tab."
    ],
    "bShowGrid": [
      "bool",
      "Whether or not the grid should be visible by default for the Animation Editor(s)"
    ],
    "bHighlightOrigin": [
      "bool",
      "Whether or not the XYZ axis at the origin should be highlighted on the grid by default"
    ],
    "bMuteAudio": [
      "bool",
      "Whether or not audio should be muted by default for the Animation Editor(s)"
    ]
  },
  "methods": []
}