{
  "name": "UPythonScriptPluginSettings",
  "inherits": "UDeveloperSettings",
  "doc": "Configure the Python plug-in.",
  "properties": {
    "StartupScripts": [
      "TArray<FString>",
      2,
      "Array of Python scripts to run at start-up (run before the first Tick after the Engine has initialized)."
    ],
    "AdditionalPaths": [
      "TArray<FDirectoryPath>",
      2,
      "Array of additional paths to add to the Python system paths."
    ],
    "bIsolateInterpreterEnvironment": [
      "bool",
      2,
      "Should the embedded interpreter be run in isolation mode. In isolation, the standard PYTHON* environment variables (PYTHONPATH,\nPYTHONHOME, etc), the script's directory and the user's site-packages directory are ignored by the interpreter. This\nprevents incompabible software to crash the engine. Consider turning this option off if you tightly control your Python\nenvironment and you are sure everything is compatible. Note that the UE_PYTHONPATH environment variable is added to 'sys.path'\nwhether the interpreter runs in insolation mode or not."
    ],
    "bDeveloperMode": [
      "bool",
      2,
      "Should Developer Mode be enabled on the Python interpreter *for all users of the project*\nNote: Most of the time you want to enable bDeveloperMode in the Editor Preferences instead!\n\n(will also enable extra warnings (e.g., for deprecated code), and enable stub code generation for\nuse with external IDEs)."
    ],
    "bRunPipInstallOnStartup": [
      "bool",
      2,
      "Should the pip install task be run on editor startup.\n\nNOTE: The project pip install directory: <ProjectDir>/Intermediate/PipInstall/Lib/site-packages\n      will still be added to site package path, if it exists, to allow for pre-populated installs\n      even auto-running UBT PipInstall is disabled.\n\n      See <ProjectDir>/Intermediate/PipInstall/merged_requirements.in for listing of required packages."
    ],
    "bPipStrictHashCheck": [
      "bool",
      2,
      "Require pip to use strict hash checking for all packages\nWARNING: Disabling this setting is a security risk, particularly when combined with IndexUrl override"
    ],
    "bOfflineOnly": [
      "bool",
      2,
      "Only run pip to generate merged requiremnts and/or validate requested packages are installed"
    ],
    "OverrideIndexURL": [
      "FString",
      2,
      "Override all index/extra-index URLs, this is useful for internal NAT installs (using e.g. devpi or similar index cache)\nWARNING: Strict hash checks should be enabled if an override index url is used"
    ],
    "bRemoteExecution": [
      "bool",
      2,
      "Should remote Python execution be enabled?"
    ],
    "RemoteExecutionMulticastGroupEndpoint": [
      "FString",
      2,
      "The multicast group endpoint (in the form of IP_ADDRESS:PORT_NUMBER) that the UDP multicast socket should join"
    ],
    "RemoteExecutionMulticastBindAddress": [
      "FString",
      2,
      "The adapter address that the UDP multicast socket should bind to, or 0.0.0.0 to bind to all adapters"
    ],
    "RemoteExecutionSendBufferSizeBytes": [
      "int",
      2,
      "Size of the send buffer for the remote endpoint connection"
    ],
    "RemoteExecutionReceiveBufferSizeBytes": [
      "int",
      2,
      "Size of the receive buffer for the remote endpoint connection"
    ],
    "RemoteExecutionMulticastTtl": [
      "uint8",
      2,
      "The TTL that the UDP multicast socket should use (0 is limited to the local host, 1 is limited to the local subnet)"
    ]
  },
  "methods": []
}