{
  "name": "USpringArmComponent",
  "inherits": "USceneComponent",
  "doc": "This component tries to maintain its children at a fixed distance from the parent,\nbut will retract the children if there is a collision, and spring back when there is no collision.\n\nExample: Use as a 'camera boom' or 'selfie stick' to keep the follow camera for a player from colliding into the world.",
  "properties": {
    "TargetArmLength": [
      "float32",
      "Natural length of the spring arm when there are no collisions"
    ],
    "SocketOffset": [
      "FVector",
      "offset at end of spring arm; use this instead of the relative offset of the attached component to ensure the line trace works as desired"
    ],
    "TargetOffset": [
      "FVector",
      "Offset at start of spring, applied in world space. Use this if you want a world-space offset from the parent component instead of the usual relative-space offset."
    ],
    "ProbeSize": [
      "float32",
      "How big should the query probe sphere be (in unreal units)"
    ],
    "ProbeChannel": [
      "ECollisionChannel",
      "Collision channel of the query probe (defaults to ECC_Camera)"
    ],
    "CameraLagSpeed": [
      "float32",
      "If bEnableCameraLag is true, controls how quickly camera reaches target position. Low values are slower (more lag), high values are faster (less lag), while zero is instant (no lag)."
    ],
    "CameraRotationLagSpeed": [
      "float32",
      "If bEnableCameraRotationLag is true, controls how quickly camera reaches target position. Low values are slower (more lag), high values are faster (less lag), while zero is instant (no lag)."
    ],
    "CameraLagMaxTimeStep": [
      "float32",
      "Max time step used when sub-stepping camera lag."
    ],
    "CameraLagMaxDistance": [
      "float32",
      "Max distance the camera target may lag behind the current location. If set to zero, no max distance is enforced."
    ],
    "bDoCollisionTest": [
      "bool",
      "If true, do a collision test using ProbeChannel and ProbeSize to prevent camera clipping into level."
    ],
    "bUsePawnControlRotation": [
      "bool",
      "If this component is placed on a pawn, should it use the view/control rotation of the pawn where possible?\nWhen disabled, the component will revert to using the stored RelativeRotation of the component.\nNote that this component itself does not rotate, but instead maintains its relative rotation to its parent as normal,\nand just repositions and rotates its children as desired by the inherited rotation settings. Use GetTargetRotation()\nif you want the rotation target based on all the settings (UsePawnControlRotation, InheritPitch, etc).\n\n@see GetTargetRotation(), APawn::GetViewRotation()"
    ],
    "bInheritPitch": [
      "bool",
      "Should we inherit pitch from parent component. Does nothing if using Absolute Rotation."
    ],
    "bInheritYaw": [
      "bool",
      "Should we inherit yaw from parent component. Does nothing if using Absolute Rotation."
    ],
    "bInheritRoll": [
      "bool",
      "Should we inherit roll from parent component. Does nothing if using Absolute Rotation."
    ],
    "bEnableCameraLag": [
      "bool",
      "If true, camera lags behind target position to smooth its movement.\n@see CameraLagSpeed"
    ],
    "bEnableCameraRotationLag": [
      "bool",
      "If true, camera lags behind target rotation to smooth its movement.\n@see CameraRotationLagSpeed"
    ],
    "bUseCameraLagSubstepping": [
      "bool",
      "If bUseCameraLagSubstepping is true, sub-step camera damping so that it handles fluctuating frame rates well (though this comes at a cost).\n@see CameraLagMaxTimeStep"
    ],
    "bDrawDebugLagMarkers": [
      "bool",
      "If true and camera location lag is enabled, draws markers at the camera target (in green) and the lagged position (in yellow).\nA line is drawn between the two locations, in green normally but in red if the distance to the lag target has been clamped (by CameraLagMaxDistance)."
    ],
    "bClampToMaxPhysicsDeltaTime": [
      "bool",
      "If true AND the view target is simulating using physics then use the same max timestep cap as the physics system. Prevents camera jitter when delta time is clamped within Chaos Physics."
    ]
  },
  "methods": [
    {
      "name": "GetTargetRotation",
      "return": "FRotator",
      "const": true,
      "doc": "Get the target rotation we inherit, used as the base target for the boom rotation.\nThis is derived from attachment to our parent and considering the UsePawnControlRotation and absolute rotation flags.",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "GetUnfixedCameraPosition",
      "return": "FVector",
      "const": true,
      "doc": "Get the position where the camera should be without applying the Collision Test displacement",
      "ufunction": true,
      "meta": null,
      "args": []
    },
    {
      "name": "IsCollisionFixApplied",
      "return": "bool",
      "const": true,
      "doc": "Is the Collision Test displacement being applied?",
      "ufunction": true,
      "meta": null,
      "args": []
    }
  ]
}